reviews/2013/2013-05-31-monthly-review.md
---
title: Monthly review: May, 2013 
tags: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Review Items <code>[4/4]</code></a>
<ul>
<li><a href="#sec-1-1">Reading</a></li>
<li><a href="#sec-1-2">Learn</a></li>
<li><a href="#sec-1-3">Work</a></li>
<li><a href="#sec-1-4">Life</a></li>
<li><a href="#sec-1-5">Emacs</a></li>
<li><a href="#sec-1-6">Reviews</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
from 19th of this month, I restarted GTD after stopped half year.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Review Items <code>[4/4]</code></h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><code>[X]</code> Review monthly agenda F12 a v m 
</li>
<li><code>[X]</code> Check clocking data for this month v c b
</li>
<li><code>[X]</code> Review clock report for this month R
</li>
<li><code>[X]</code> Check where we spent time (too much or too little) and rectify this week
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Reading</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Learn You a Haskell for great good
</li>
<li>Vim handbook
</li>
<li>Seven languages in seven weeks 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Learn</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>haskell programming 
</li>
<li>haskell programming
</li>
<li>R Language
</li>
<li>setup the R and clojure ENV
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Work</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>finished the crt project
</li>
<li>got meeting with guorong
</li>
<li>rewrite website with hakyll
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Life</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>started the beer day and drink day 
</li>
<li>started using ledger
</li>
<li>more sporting 
</li>
<li>no more drink 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Emacs</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>added gnus back
</li>
<li>added clojure support 
</li>
<li>added haskell support
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Reviews</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>BIZ 30 hours
</li>
<li>GTD 9.5 hours 
</li>
<li>LEARN 36.5 hours
</li>
<li>SLEEP 96 hours (8 hours per day)
</li>
<li>iEmacs 17 hours (little bit more)
</li>

<li><a href="file:///reviews/2013/2013-05-26-weekly-review-ends-may-26-2013.html">Weekly review: Week ending May 26, 2013</a>
</li>
</ul>
</div>
</div>
</div>
